{
    "defaultModel": "gpt-3.5-turbo",
    "defaultType": "openai",
    "defaultAuth": "api-key",
    "defaultBase": "",
    "defaultVersion": "",
    "defaultKey": "",
    "availableModels": [
      {
        "value": "gpt-3.5-turbo",
        "label": "GPT-3.5-TURBO (Default ChatGPT)"
      },
      {
        "value": "gpt-3.5-turbo-0613",
        "label": "GPT-3.5-TURBO-0613"
      },
      {
        "value": "gpt-3.5-turbo-0301",
        "label": "GPT-3.5-TURBO-0301 (Legacy)"
      },
      {
        "value": "gpt-3.5-turbo-16k",
        "label": "GPT-3.5-TURBO-16K"
      },
      {
        "value": "gpt-3.5-turbo-16k-0613",
        "label": "GPT-3.5-TURBO-16K-0613"
      },
      {
        "value": "gpt-4",
        "label": "GPT-4 (Limited Beta)"
      },
      {
        "value": "gpt-4-0613",
        "label": "GPT-4-0613 (Limited Beta)"
      },
      {
        "value": "gpt-4-0314",
        "label": "GPT-4-0314 (Limited Beta, Legacy)"
      },
      {
        "value": "gpt-4-32k",
        "label": "GPT-4-32K (Limited Beta)"
      },
      {
        "value": "gpt-4-32k-0613",
        "label": "GPT-4-32K-0613 (Limited Beta)"
      },
      {
        "value": "gpt-4-32k-0314",
        "label": "GPT-4-32K-0314 (Limited Beta, Legacy)"
      }
    ],
    "writingCharacters": [
      {
        "value": "DISC_genie",
        "label": "DISC Genie",
        "searchendpoint": "https://genaihackathonaisearch.search.windows.net",
        "searchkey": "",
        "searchindex": "disc",
        "roleinformation": "- You are a Supply Chain expert working at Deloitte Canada\n- You have been provided with a document called DISC. When asked a question, leverage your learnings from DISC\n- Leverage your existing knowledge base to further enhance the response\n- If you don't find relevant information in DISC, ask the users for further information and use your existing knowledge to give answers\n-Your first message should be 'Welcome to Deloitte Integrated Supply Chain (DISC) AI Chatbot. What can I help you with today?'."
      },
      {
        "value": "sales_genie",
        "label": "Sales Genie",
        "searchendpoint": "https://genaihackathonaisearch.search.windows.net",
        "searchkey": "",
        "searchindex": null,
        "roleinformation": "- You are an AI chatbot, designed to simulate a smart factory/digital automation expert at Deloitte Canada. - You have access to several sample proposal documents that detail: 1. Smart factory strategy and roadmap development 2. Smart factory use case proof-of-concepts - Your first message to every user should be: “Welcome to Sales Genie AI Chatbot. What can I help you with today?”. - When tasked with developing a new proposal, sequentially prompt the user with the following questions, waiting for a response after each question before proceeding to the next: 1. Request the name of the industry 2. Ask for the client's name and any specific information about the client that will assist in tailoring your response 3. Inquire about the domain of the supply chain  - When creating a new proposal, follow these steps: 1. Define a high-level approach, this will serve as the introduction slide. Ensure to include at least 4-5 bullet points to provide a comprehensive overview. 2. Develop a detailed project plan, indicating the expected duration. Each major task or phase could be a separate slide, with each slide containing 4-5 bullet points detailing the tasks involved and their timelines. 3. List out deliverables, specifying the purpose of each deliverable. Each deliverable can be a separate slide, with a minimum of 4-5 bullet points explaining the significance and expected outcomes of each. 4. Outline the overall project assumptions, these can be summarized on a single slide with 4-5 bullet points providing a clear understanding of the assumptions made. - Your primary task is to create a proposal based on the client and industry information provided by the user. To achieve this, adhere to the following sequence: 1. Utilize your existing knowledge base to draft a response based on the provided client and industry information. This should be structured in a way that each major point can be used as content for individual slides, with each slide containing at least 4-5 bullet points. 2. Leverage past Deloitte proposals to tailor your response according to Deloitte's methodology, ensuring each key point can stand alone on a PowerPoint slide and is supported by 4-5 detailed bullet points."
      }
    ],
    "writingTones": [
      "Assertive",
      "Authoritative",
      "Casual",
      "Confident",
      "Condescending",
      "Conversational",
      "Diplomatic",
      "Direct",
      "Eloquent",
      "Formal",
      "Friendly",
      "Humorous",
      "Informative",
      "Inspiring",
      "Intense",
      "Irritable",
      "Joking",
      "Polite",
      "Sarcastic",
      "Sincere",
      "Soothing",
      "Stern",
      "Sympathetic",
      "Tactful",
      "Witty"
    ],
    "writingStyles": [
      "Academic",
      "Analytical",
      "Argumentative",
      "Conversational",
      "Creative",
      "Critical",
      "Descriptive",
      "Explanatory",
      "Informative",
      "Instructive",
      "Investigative",
      "Journalistic",
      "Metaphorical",
      "Narrative",
      "Persuasive",
      "Poetic",
      "Satirical",
      "Technical"
    ],
    "writingFormats": [
      {
        "value": "Answer as concise as possible",
        "label": "Concise"
      },
      {
        "value": "Think step-by-step",
        "label": "Step-by-step"
      },
      {
        "value": "Answer in painstakingly detail",
        "label": "Extreme Detail"
      },
      {
        "value": "Explain like I'm five",
        "label": "Explain Like I'm Five"
      }
    ],
    "showDownloadLink": true,
    "allowDarkModeToggle": true,
    "allowSettingsModal": true,
    "allowDatabaseModal": true,
    "showTwitterLink": false,
    "showFeedbackLink": false
  }